doc/mandoku-format.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The mandoku text format</title>
<!-- 2013-05-25 Sat 10:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

</head>
<body>
<div id="content">
<h1 class="title">The mandoku text format</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Based on org-mode</a></li>
<li><a href="#sec-2">2. Mandoku extensions to org-mode</a>
<ul>
<li><a href="#sec-2-1">2.1. page identification</a></li>
</ul>
</li>
<li><a href="#sec-3">3. JSON format</a>
<ul>
<li><a href="#sec-3-1">3.1. type: base</a></li>
<li><a href="#sec-3-2">3.2. further extensions:</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Based on org-mode</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
* Introduction
 :PROPERTIES:
 :CUSTOM_ID: intro
 :END:
</pre>

<p>
Emacs org-mode (see <a href="http://orgmode.org/">Org-Mode: Your Life in Plain Text</a>) is basically
plain text with some outlining, formatting and hyperlinking
conventions.  This makes it a lightweight text format that covers
some middle ground between absolutely complete plain text (if such a
thing exists) and complex markup languages like XML.  Since it even
supports footnotes and is easily converted to HTML, Latex and
OpenOffice format, it is useable even for research articles.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Mandoku extensions to org-mode</h2>
<div class="outline-text-2" id="text-2">
<p>
Based on earlier work on a text model for premodern Chinese texts,
requirements for representing such texts where established.  While
most of these requirements concern the processing, it was also
established that a convenient framework for adressing characters in
the text is needed.  This is done by using the page as a fundamental
unit and text lines on that page as secondary unit.  Within lines,
characters are then simply indexed.  Mandoku thus requires pages and
lines marked in the text to function properly.
</p>
</div>


<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> page identification</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A page identification is given at the start of a page with the
following template: 
</p>
<pre class="example">
&lt;pb:[edition identification]_[text identification]_[page identification]&gt;
</pre>
<p>
for example:
</p>
<pre class="example">
&lt;pb:T_T51n2076_0281c&gt;
</pre>
<p>
would be 
</p>
<ul class="org-ul">
<li>edition identifier:  T
</li>
<li>text identifier: T51n2076
</li>
<li>page identifier: 281c
</li>
</ul>

<p>
These three pieces are then assembled according to the template
shown above.  All of these can be chosen as needed. The edition
identifies the printed text, which supposedly is the source of this
digital edition.  The text identifier should identify the text
uniquely in a collection, while the page identifier should be
unique within that text.  For text digitized from woodblock prints,
it is therefore necessary to work the section, booklet or whatever
into this identifier to disambiguate the page number.
</p>

<p>
   If there are multiple editions of the same text, the &lt;pb: template
   always has the page identifier for the edition associated with this
   specific version of the digital text.  In some cases, an additional
   identifier for a reference edition has to be introduced, in such
   cases the template would be to simply change 'pb' to 'md' in the
   page identification template, thus resulting in something like
   this:
:&lt;md:T<sub>T51n2076</sub><sub>0281c</sub>&gt;
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> JSON format</h2>
<div class="outline-text-2" id="text-3">
<p>
The JSON format splits a text across several separate structures:
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> type: base</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-js">{
   <span style="color: #8b2252;">"_id"</span>: <span style="color: #8b2252;">"T08n0250"</span>,
   <span style="color: #8b2252;">"_rev"</span>: <span style="color: #8b2252;">"2-153551fa267751cc55344c8bafd6c2c6"</span>,
   <span style="color: #8b2252;">"title"</span>: <span style="color: #8b2252;">"&#25705;&#35382;&#33324;&#33509;&#27874;&#32645;&#34588;&#22823;&#26126;&#21610;&#32147;"</span>,
   <span style="color: #8b2252;">"textpath"</span>: <span style="color: #8b2252;">"ers/chris/00scratch/tmp/test/T08n0250"</span>,
   <span style="color: #8b2252;">"sections"</span>: [
       [
           <span style="color: #8b2252;">"T08n0250-001"</span>,
           337
       ]
   ],
   <span style="color: #8b2252;">"versions"</span>: [
       <span style="color: #8b2252;">"local"</span>,
       <span style="color: #8b2252;">"master"</span>,
       <span style="color: #8b2252;">"&#12304;CBETA&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;unknown&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#19975;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#20013;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#20803;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#21271;&#34255;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#21335;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#21335;&#34255;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#21407;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#23435;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#23470;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#24503;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#26126;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#26126;&#30064;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#30693;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#30951;&#30722;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#32854;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#37261;&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#40599;-CB&#12305;"</span>,
       <span style="color: #8b2252;">"&#12304;&#40599;&#12305;"</span>
   ],
   <span style="color: #8b2252;">"sigle-m"</span>: <span style="color: #8b2252;">"0bb3b4fdefc4e70e588233640d0a44607b6a8d62"</span>,
   <span style="color: #8b2252;">"baseversion"</span>: <span style="color: #8b2252;">"master"</span>,
   <span style="color: #8b2252;">"toc"</span>: [
       [
           1,
           <span style="color: #8b2252;">"&#25705;&#35382;&#33324;&#33509;&#27874;&#32645;&#34588;&#22823;&#26126;&#21610;"</span>,
           <span style="color: #8b2252;">"T08n0250-001"</span>,
           4
       ]
   ],
   <span style="color: #8b2252;">"fac"</span>: 100000,
   <span style="color: #8b2252;">"type"</span>: <span style="color: #8b2252;">"base"</span>,
   <span style="color: #8b2252;">"coll"</span>: <span style="color: #8b2252;">"CBETA"</span>
}
</pre>
</div>
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> further extensions:</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christian Wittern</p>
<p class="date">Created: 2013-05-25 Sat 10:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.2)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
